{
  "name": "Geofísico Mención Atmósfera",
  "version": 5,
  "courses": [
    {
      "credits": 3,
      "code": "BT1211",
      "name": "Aplicaciones de la Biología a la Ingeniería y Ciencias",
      "department": {
        "name": "Departamento de Ingeniería Química y Biotecnología",
        "code": "DQBIM",
        "id": 307
      },
      "students_per_course": 88,
      "approval_rate": 0.96,
      "purpose": "El curso Aplicaciones de la Biología a la Ingeniería y Ciencias tiene como propósito que el estudiante comprenda la relación existente entre la biología, la física y la química, y su aplicación en ciencias y en ingeniería. Para ello, se utilizan ejemplos prácticos de esta relación, a través de conceptos biológicos nuevos y ya conocidos, con lo cual se introduce al estudiante en el quehacer profesional científico e ingenieril. Mediante estos ejemplos, se considera la aplicación del método científico y sus etapas. \r\nEl curso está planteado para comprender la biología con criterio analítico. Con ello, se logra  que el estudiante comprenda que los sistemas biológicos son complejos, interactivos y dinámicos. Junto con lo anterior el estudiante visualiza soluciones biológicas a partir de casos reales que consideran dimensiones éticas asociadas a las nuevas tecnologías.\r\nLa metodología de este curso permite que el estudiante  participe  activamente de manera individual y colectiva en la construcción de su aprendizaje.",
      "requirements": [],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=48665",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "CD1100",
      "name": "Desafíos de Innovación en Ingeniería y Ciencias",
      "department": {
        "name": "Escuela de Ingeniería y Ciencias",
        "code": "ES",
        "id": 12
      },
      "students_per_course": 64,
      "approval_rate": 0.99,
      "purpose": "El curso de Desafíos de Innovación en Ingeniería y Ciencias  corresponde al primero de tres cursos del Plan Común que abordan la formación de los estudiantes en el proceso de innovación en ingeniería y ciencias. \r\nA lo largo del curso el estudiante tendrá oportunidades para conocer demandas de un usuario real,  describir en profundidad la necesidad y su contexto, definir un problema a resolver y proponer soluciones innovadoras que mejoren la vida de los usuarios. \r\nDurante el curso los estudiantes desarrollan trabajo en equipo, haciendo especial énfasis tanto al cumplimiento de compromisos adquiridos como en la revisión crítica del desempeño de cada integrante, para el logro del propósito común del equipo que es dar solución a los desafíos encomendados.",
      "requirements": [],
      "equivalences": [
        "EI1101",
        "EI1102"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=49257",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 0,
      "code": "EI1090",
      "name": "Examen de Suficiencia en Inglés I",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 336,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [],
      "equivalences": [
        "EI19A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=16498",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "MA1101",
      "name": "Introducción al Álgebra",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 93,
      "approval_rate": 0.75,
      "purpose": "El curso Introducción al Álgebra tiene como propósito desarrollar la habilidad de abstracción y de razonamiento lógico del estudiante, familiarizándolo con el lenguaje matemático básico de forma que lo comprenda y lo utilice para formular, escribir y demostrar proposiciones matemáticas simples, obteniendo, de esta forma, herramientas fundamentales para los cursos de ciencias e ingeniería posteriores.\r\n\r\nAsimismo, el curso brinda las herramientas necesarias para que el estudiante utilice técnicas de demostración como la inducción, demostraciones directas e indirectas, demostraciones por casos, y demostraciones por reducción al absurdo.\r\n\r\nPara entender el lenguaje matemático básico el estudiante debe ser capaz de comprender la lógica simbólica, el álgebra de conjuntos, las nociones de función y relación, conceptos básicos de conteo y estructuras algebraicas, adquiriendo soltura en la manipulación y operación de proposiciones, cuantificadores, conjuntos, sumatorias, números complejos y polinomios.",
      "requirements": [],
      "equivalences": [
        "MA110"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3533",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA1001",
      "name": "Introducción al Cálculo",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 92,
      "approval_rate": 0.75,
      "purpose": "El curso MA1001, Introducción al Cálculo, entrega las herramientas y conceptos básicos que el estudiante requiere para seguir la línea de cursos de cálculo en Plan común. El curso provee además una primera aproximación a la rigurosidad necesaria en los cursos matemáticos del Plan Común.\r\nEl curso comienza con algunos complementos a la formación básica de los estudiantes en matemáticas, incluyendo contenidos de propiedades de los números reales, geometría analítica y trigonometría. La mayor parte del curso se enfoca en establecer los conceptos básicos que subyacen al cálculo diferencial e integral, incluyendo funciones de una variable real, el estudio de límites de sucesiones, límites de funciones y cálculo de asíntotas. Finalmente se introducen el concepto y la operatoria de derivadas, que son estudiadas en mayor detalle en el siguiente curso de la Línea de Cálculo.\r\nLa metodología de trabajo incluye clases de cátedra expositivas y clases auxiliares enfocadas en el desarrollo y la resolución de problemas por parte de los estudiantes con apoyo del equipo docente.\r\nSe espera que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o Código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [],
      "equivalences": [
        "MA100"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=12398",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "FI1000",
      "name": "Introducción a la Física Clásica",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 94,
      "approval_rate": 0.86,
      "purpose": "Este curso se dicta durante el primer semestre del Plan Común. Al finalizar el curso el estudiante manejará conceptos fundamentales de mecánica, como cinemática, leyes de Newton y leyes de conservación, para una partícula puntual, sistemas de partículas puntuales, sólidos rígidos y fluidos. Estos conceptos son necesarios para avanzar en el aprendizaje de la física, tanto en el Plan Común como en las distintas especialidades que ofrece la Facultad.\r\nEl curso ofrecerá distintas experiencias de laboratorio para verificar la validez de los conceptos planteados, permitiendo desarrollar competencias experimentales y de trabajo en equipo. El equipo docente promoverá que estas experiencias se desarrollen en un contexto de responsabilidad y honestidad.",
      "requirements": [],
      "equivalences": [
        "FI1001"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=47473",
      "weekly_modules": {
        "labs": 2,
        "lectures": 2,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA1102",
      "name": "Álgebra Lineal",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 89,
      "approval_rate": 0.89,
      "purpose": "El propósito de este curso es proporcionar los conocimientos fundamentales del álgebra lineal desde un punto de vista teórico y práctico, con un énfasis especial en tópicos que serán relevantes para cursos posteriores en la comprensión y modelamiento de fenómenos lineales, y en la aproximación de fenómenos no lineales.\r\n\r\nSe espera que el estudiante comprenda las operaciones básicas de matrices, sus propiedades y su relación con distintos problemas del álgebra lineal y otras aplicaciones; que asimile el concepto de espacio vectorial y conozca ejemplos importantes que se aplicarán en cursos posteriores; que comprenda y conozca los principales resultados asociados a subespacios vectoriales y dimensión; que comprenda la geometría de espacios vectoriales reales y complejos y conceptos como ortogonalidad, paralelismo y proyecciones; y que asimile el concepto de transformaciones lineales definidas en espacios vectoriales de dimensión finita, que comprenda su representación a través de matrices, que calcule sus valores y vectores propios y que, cuando sea posible, obtenga su forma diagonal.\r\nSe espera que el estudiante actúe en las actividades que se le \r\n proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas",
      "requirements": [
        "MA1101",
        "MA110"
      ],
      "equivalences": [
        "MA1B2"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3462",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA1002",
      "name": "Cálculo Diferencial e Integral",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 94,
      "approval_rate": 0.77,
      "purpose": "El propósito de este curso es proporcionar los conocimientos fundamentales del cálculo en una variable real. Se espera que el estudiante asimile los conceptos de derivada y de integral, así como la relación entre ambos conceptos dado por el Teorema Fundamental del Cálculo. \r\n\r\nGran parte del curso se enfoca en el uso de las derivadas para estudiar el comportamiento de las funciones reales en una variable real; y en la aplicación de las integrales para el cálculo de áreas, volúmenes de revolución y centros de masa de curvas, entre otros, que son elementales para el planteamiento y resolución de problemas en ingeniería. El curso concluye con el tratamiento de integrales impropias, series infinitas, series de potencia y un estudio inicial de curvas en el espacio.\r\nSe espera que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [
        "MA1001",
        "MA100"
      ],
      "equivalences": [
        "MA1A2"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3459",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 0,
      "code": "EI2090",
      "name": "Examen de Suficiencia en Inglés II",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 203,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [
        "EI1090"
      ],
      "equivalences": [
        "EI29A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=16502",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 3,
      "code": "CC1000",
      "name": "Herramientas Computacionales para Ingeniería y Ciencias",
      "department": {
        "name": "Departamento de Ciencias de la Computación",
        "code": "DCC",
        "id": 5
      },
      "students_per_course": 47,
      "approval_rate": 0.98,
      "purpose": "El curso Herramientas Computacionales para Ingeniería y Ciencias tiene por finalidad asegurar que todos los estudiantes, independientemente de sus conocimientos previos, logren un nivel de manejo de las herramientas computacionales básicas tales como: Excel, R, MATLAB, Maple, LaTeX, entre otros, que permita la resolución de problemas simples de la ingeniería y ciencias.\r\n\r\nEl curso es eminentemente práctico y se orienta a la resolución de problemas, motivando la introducción de las herramientas necesarias para resolverlos, y profundizando en las características de estas herramientas a medida que los problemas planteados lo requieren.",
      "requirements": [],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=4593",
      "weekly_modules": {
        "labs": 1,
        "lectures": 1,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "FI1100",
      "name": "Introducción a la Física Moderna",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 83,
      "approval_rate": 0.89,
      "purpose": "Este curso tiene como propósito que el estudiante aplique conceptos de la física fundamental tales como conceptos de oscilaciones y ondas, óptica geométrica y ondulatoria, así como temáticas desarrolladas a partir del siglo XX, en particular relatividad especial y física cuántica. Durante el curso se destacarán las observaciones que llevaron al desarrollo de estas áreas y las aplicaciones tecnológicas que han surgido de ellas, lo cual se reforzará mediante varias experiencias de laboratorio.\r\nLos conceptos vistos en este curso entregarán al estudiante una visión crítica de los desarrollos tecnológicos más recientes.\r\nLas experiencias de laboratorio ofrecidas en este curso permitirán desarrollar competencias experimentales, de trabajo en equipo, de comunicación y de compromiso ético, basado en la responsabilidad y honestidad.",
      "requirements": [
        "FI1000",
        "MA1101",
        "MA1001"
      ],
      "equivalences": [
        "FI1002"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=48273",
      "weekly_modules": {
        "labs": 2,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "CC1002",
      "name": "Introducción a la Programación",
      "department": {
        "name": "Departamento de Ciencias de la Computación",
        "code": "DCC",
        "id": 5
      },
      "students_per_course": 83,
      "approval_rate": 0.89,
      "purpose": "Este curso tiene por finalidad que los estudiantes resuelvan problemas de baja complejidad,\r\nsiguiendo una ruta metodológica y generando programas capaces de dar respuestas a las\r\ndistintas peticiones y finalidades de éstos. Los problemas estarán definidos en diversos\r\ndominios de aplicación, pudiendo tener representación en el ámbito de la ingeniería. Los\r\nestudiantes podrán centrarse fundamentalmente en el desarrollo de una metodología de\r\ntrabajo que los llevará a adquirir rigor procedimental para enfrentarse a la resolución de estas\r\ntareas en base al razonamiento algorítmico y lógico. Por ello, las clases tendrán una estructura\r\nteórico-práctica en las que se introducirán las nuevas temáticas a partir de problemas\r\nseleccionados y se contará con orientaciones metodológicas por parte de los ayudantes de la\r\ncátedra",
      "requirements": [],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=5571",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 1
      }
    },
    {
      "credits": 3,
      "code": "CD1201",
      "name": "Proyecto de Innovación en Ingeniería y Ciencias",
      "department": {
        "name": "Escuela de Ingeniería y Ciencias",
        "code": "ES",
        "id": 12
      },
      "students_per_course": 62,
      "approval_rate": 0.99,
      "purpose": "El curso Proyecto de Innovación en Ingeniería y Ciencias tiene como propósito que el estudiante reconozca y entienda un problema de manera fundada y dimensionada, levantando y gestionando herramientas y fuentes de información, en torno a un contexto y usuario, lo cual le permitirá encontrar a través de herramientas de validación y experimentación, espacios de oportunidad explorando nuevas perspectivas o puntos vista del problema definido inicialmente. El estudiante logrará definir un problema y un desafío reencuadrado lo que le permitirá comunicar un proyecto conducente al desarrollo de soluciones con base tecnológica. El estudiante a través del uso de herramientas análogas y digitales logrará conceptualizar y materializar una propuesta de solución, desarrollando prototipos de resolución baja y media que someterá a pruebas y validaciones de funcionalidad y usabilidad con pares y usuarios, lo cual le permitirá presentar una propuesta final que integre lo aprendido a través de las iteraciones, comunicando y documentando el proceso creativo llevado a cabo.",
      "requirements": [
        "CD1100"
      ],
      "equivalences": [
        "EI2001"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=48729",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA2001",
      "name": "Cálculo en Varias Variables",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 92,
      "approval_rate": 0.87,
      "purpose": "El propósito de este curso es proporcionar los conocimientos fundamentales del cálculo en varias variables reales.  Se espera que el estudiante asimile los conceptos de sucesiones, límites, continuidad, derivadas e integrales en varias variables. Además, se espera que el estudiante pueda usar estos conceptos para estudiar el comportamiento de funciones en varias variables y aplicarlos, por un lado, a problemas de modelamiento en los que se deba buscar máximos y mínimos, como una primera aproximación al posterior curso de Optimización, y por otro para el cálculo de volúmenes, masas y momentos de inercia que son fundamentales para la resolución de problemas en ingeniería. \r\nSe espera además que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [
        "MA1002",
        "MA1102"
      ],
      "equivalences": [
        "MA2A1",
        "MA22A",
        "MA220"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3463",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA2601",
      "name": "Ecuaciones Diferenciales Ordinarias",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 91,
      "approval_rate": 0.88,
      "purpose": "El propósito de este curso es proporcionar los conocimientos teóricos y prácticos necesarios para resolver familias específicas de ecuaciones diferenciales ordinarias (EDO) e interpretar las soluciones de estas en aplicaciones a las ciencias y a la ingeniería.\r\nSe espera que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [
        "MA1002",
        "MA1102"
      ],
      "equivalences": [
        "MA2G1",
        "MA26A",
        "MA261"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3531",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "FI2001",
      "name": "Mecánica",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 90,
      "approval_rate": 0.81,
      "purpose": "Este curso tiene como propósito que el estudiante utilice las leyes de la mecánica de Newton para modelar sistemas dinámicos constituidos por una o varias partículas.\r\nUn aspecto central del curso es lograr que el estudiante pueda resolver problemas de mecánica, utilizando las herramientas del cálculo diferencial e integral.  \r\nAl termino del curso el estudiante demostrará que:\r\nRA1: Modela sistemas compuestos por partículas en movimiento, identificando las variables cinemáticas (posición, velocidad y aceleración).\r\nRA2: Utiliza las leyes de Newton para obtener sistemas de ecuaciones diferenciales que describen el movimiento de sistemas compuestos por partículas y agentes externos.\r\nRA3: Predice el movimiento de sistemas de una o varias partículas, utilizando los conceptos de trabajo, energía, momentum angular y principio de mínima acción.\r\nRA4: Determina modos de oscilación y frecuencias normales de sistemas de una o más partículas en configuraciones cercanas al equilibrio estable.\r\nRA5: Realiza sus actividades académicas, basándose en sus capacidades, demostrando con ello honestidad en su comportamiento sin incurrir en plagio o copia.",
      "requirements": [
        "FI1100",
        "FI1002",
        "MA1002",
        "MA1102"
      ],
      "equivalences": [
        "FI2A1",
        "FI21A",
        "FI215"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3454",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 3
      }
    },
    {
      "credits": 6,
      "code": "FI2003",
      "name": "Métodos Experimentales",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 54,
      "approval_rate": 0.96,
      "purpose": "Este curso tiene como propósito que el estudiante desarrolle habilidades de trabajo experimental, utilizando metodologías experimentales generales y protocolos de seguridad. Para lograrlo, el curso se organiza principalmente en base a un conjunto de experiencias de electrónica básica, las cuales se realizan semanalmente en un laboratorio de física. Una clase teórica semanal permite introducir los conceptos de electrónica necesarios para interpretar los resultados experimentales.\r\nLas sesiones de laboratorio de este curso se desarrollan en equipos de trabajo. Cada equipo demuestra habilidades de comunicación escrita a través de los informes de laboratorios. Asimismo, demuestra compromiso ético cumpliendo con responsabilidad y honestidad frente a cada a tarea.",
      "requirements": [
        "MA1002",
        "FI1100"
      ],
      "equivalences": [
        "FI2A3",
        "FI25A",
        "FI35A",
        "FI2003E"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3494",
      "weekly_modules": {
        "labs": 3,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "IQ2211",
      "name": "Química",
      "department": {
        "name": "Departamento de Ingeniería Química y Biotecnología",
        "code": "DQBIM",
        "id": 307
      },
      "students_per_course": 84,
      "approval_rate": 0.83,
      "purpose": "El curso tiene como propósito que el estudiante demuestre que experimenta, resuelve problemas, analiza, discute la composición y estructura de los materiales. Se busca, además, que el estudiante logre calcular e interpretar conceptos de equilibrio químico y reacciones tales como ácido-base, oxidación y reducción, entre otras.\r\n\r\nLo anterior permite que el estudiante relacione dichos contenidos con las propiedades de los materiales: estructura electrónica, tipos de enlazamientos, estados de la materia y de sus procesos de transformación química. Además, logra establecer la importancia de estos tópicos en la aplicación a casos de la ingeniería y las ciencias.",
      "requirements": [
        "FI1100",
        "CC1002"
      ],
      "equivalences": [
        "CM1001"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=48737",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA2002",
      "name": "Cálculo Avanzado y Aplicaciones",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 90,
      "approval_rate": 0.86,
      "purpose": "Al terminar este curso, el estudiante:\r\n Utiliza e interpreta las variaciones de una función vectorial de variable vectorial, y las aplica para modelar y resolver problemas físicos y geométricos en el sistema de referencia mas conveniente.\r\n Reconoce las ecuaciones en derivadas parciales clásicas y las relaciona con los modelos físicos que las motivan, para ello estará familiarizado con las técnicas clásicas que se utilizan para analizar y resolver esta clase de ecuaciones.",
      "requirements": [
        "MA2001",
        "MA2601"
      ],
      "equivalences": [
        "MA2A2",
        "MA26B",
        "MA221"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=13266",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "IN2201",
      "name": "Economía",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 85,
      "approval_rate": 0.91,
      "purpose": "El curso IN 2201, Economía, tiene como propósito que el o la estudiante determine, por una parte, el propósito del estudio de las ciencias económicas y, por otra, su importancia, campo y método de acción. En este contexto, el o la estudiante logre reconocer y reflexionar por qué es relevante para el desempeño futuro de un ingeniero saber de economía.\r\n\r\nEl curso busca que los y las estudiantes desarrolle una comprensión de la estructuras y organizaciones que se encuentran presentes en la discusión pública sobre temas económicos. Adicionalmente, deben aprender a distinguir aquellos eventos que son predecibles de acuerdo a su entendimiento del funcionamiento de la economía y la interacción de los mercados, de aquellos que son novedades o paradojas que están en proceso de ser explicados y siendo parte del debate científico o público contemporáneo.",
      "requirements": [
        "MA2001"
      ],
      "equivalences": [
        "IN2C1",
        "IN41A",
        "IN301"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3882",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "FI2002",
      "name": "Electromagnetismo",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 80,
      "approval_rate": 0.86,
      "purpose": "Este curso se ubica en el 4to semestre del ciclo de formación intermedia (Plan Común). El curso permite que el estudiante caracterice y describa los fenómenos electromagnéticos, abarcando desde la electrostática y magnetostática hasta la propagación de energía electromagnética. El estudiante tendrá así las herramientas fundamentales para valorar y argumentar las múltiples aplicaciones del electromagnetismo en diversas áreas de las ingenierías y ciencias. \r\n\r\nLa metodología que se utilizará en el curso es activo - participativa con el uso de diversas estrategias.",
      "requirements": [
        "MA2001",
        "MA2601",
        "FI2001"
      ],
      "equivalences": [
        "FI33A",
        "FI2A2",
        "FI302",
        "FI2002E"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3493",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 3,
      "code": "CD2201",
      "name": "Módulo Interdisciplinario",
      "department": {
        "name": "Escuela de Ingeniería y Ciencias",
        "code": "ES",
        "id": 12
      },
      "students_per_course": 28,
      "approval_rate": 0.99,
      "purpose": "El Módulo interdisciplinario corresponde al tercer curso de la línea de innovación en Ingeniería y Ciencias del ciclo formativo del Plan Común. El curso se ubica en el cuarto semestre.\r\nA lo largo del curso el estudiante se incorporará a un equipo de trabajo donde tendrá oportunidades para conocer demandas de un usuario real, indagar en profundidad una necesidad y su contexto, definir un problema a resolver, proponer y materializar soluciones innovadoras, recurriendo a los conocimientos adquiridos en su formación intermedia, tanto en ciencias, matemáticas, como de herramientas computacionales y de comunicación principalmente.\r\nDurante el curso los estudiantes desarrollan trabajo en equipo, planifican y monitorean cada etapa del proyecto de innovación en el que participan, para asegurar el cumplimiento de las metas, el uso eficiente de recursos y considerar los alcances o efectos que puede generar sobre el medio natural, cultural y social. Para dar cuenta del proceso los estudiantes elaboran reportes del estado de avance del proyecto de innovación y exponen a diversas audiencias sus resultados.",
      "requirements": [
        "CD1201",
        "FI2003"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=60122",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA3401",
      "name": "Probabilidades",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 43,
      "approval_rate": 0.84,
      "purpose": "El curso tiene como propósito que los y las estudiantes aprendan conceptos y técnicas fundamentales de la teoría de probabilidades. En particular, el curso busca desarrollar el pensamiento probabilístico en la solución de problemas concretos, enfatizando la importancia de estas herramientas en el modelamiento matemático en ingeniería y ciencias.",
      "requirements": [
        "MA2001"
      ],
      "equivalences": [
        "MA34A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3604",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA3403",
      "name": "Probabilidades y Estadística",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 80,
      "approval_rate": 0.84,
      "purpose": "El propósito de este curso es que el/la estudiante aplique los conceptos fundamentales de la\r\nteoría de probabilidades en la modelación y solución de problemas concretos que involucran\r\nfenómenos aleatorios. También que enuncie leyes clásicas de probabilidad discretas y continuas, que calcule con ellas y que las asocie a situaciones específicas de modelación. Además que aplique la Ley de Grandes Números y del Teorema Central del Límite.\r\nOtra parte del propósito de este curso es que el/la estudiante conozca los conceptos\r\nfundamentales de la Inferencia Estadística y de los modelos lineales, y los aplique junto a los\r\nconceptos de probabilidad. Junto a esto, que conozca lo que es un muestreo aleatorio y la\r\nimportancia de la distribución Normal y su rol en el Teorema Central del Límite, que estime\r\nparámetros de una distribución y reconozca sus propiedades, y que conozca el Lema de Neyman Pearson y su aplicación en la toma de decisiones con un test de hipótesis. Adicionalmente, que aplique un modelo de regresión lineal y evalúe sus resultados. Finalmente, que aplique la teoría de tests en casos clásicos como son: la comparación de dos poblaciones, la comprobación que un conjunto de valores muestrales siguen una determinada distribución, el test de independencia en una tabla de contingencia.",
      "requirements": [
        "MA2001"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3754",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "IN3301",
      "name": "Evaluación de Proyectos",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 75,
      "approval_rate": 0.9,
      "purpose": "El curso se encuentra en el VI semestre de la carrera. Este curso de  tiene como propósito que los y las estudiantes puedan calcular el valor de un proyecto de inversión, a partir del análisis y uso de datos reales, de su estructuración en estados financieros contables (Balance, Estado de Resultados, Flujo de Caja), del diseño de estrategias financieras derivadas del diagnóstico y del uso de herramientas matemáticas financieras, desde una perspectiva tanto privada, de evaluación de negocios, como social en el caso de proyectos públicos de inversión. \r\n\r\nEl curso trabaja con una metodología activo - participativa, donde los y las estudiantes construyen su aprendizaje, en pro de desarrollar herramientas tanto de carácter económico- financiero como de trabajo en equipo. Lo anterior, incluye manejo de teoría, análisis de casos prácticos, con ejemplos de la vida cotidiana. El o la docente guía las discusiones, generando espacios de reflexión acerca del marco teórico y su aplicación, con una retroalimentación constante a los estudiantes.",
      "requirements": [
        "IN2201",
        "IN3141",
        "MA3403",
        "MA3401"
      ],
      "equivalences": [
        "IN4301"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3480",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "GF3001",
      "name": "Geofísica General",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 41,
      "approval_rate": 0.94,
      "purpose": "El curso tiene como propósito introducir a los y las estudiantes en la exploración y análisis de los procesos que se desarrollan en la Tierra sólida y que dan origen a variadas manifestaciones superficiales observadas en el día a día. Además, el y la estudiante lograrán determinar el origen de dichos procesos y su funcionamiento, considerando a la Tierra como un sistema controlado por múltiples variables. \r\n\r\nEl y la estudiante, con las nociones del modelamiento geofísico adquiridos, podrán elaborar modelos a baja y gran escala. \r\n\r\nLas estrategias metodológicas consideran clases expositivas y trabajo de laboratorio, fundamentales para el logro de los resultados de aprendizaje propuestos. Los y las estudiantes tendrán un rol protagónico en su proceso de aprendizaje; deberán trabajar activamente en las actividades de trabajo de campo y en las clases expositivas, donde su participación y autoaprendizaje son fundamentales.",
      "requirements": [
        "FI2002"
      ],
      "equivalences": [
        "GF31A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3474",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GL3101",
      "name": "Geología General",
      "department": {
        "name": "Departamento de Geología",
        "code": "DGL",
        "id": 16
      },
      "students_per_course": 38,
      "approval_rate": 0.93,
      "purpose": "El curso Geología general tiene como propósito que los y las estudiantes adquieran y utilicen los fundamentos básicos de las ciencias de la tierra para comprender como los principales procesos físicos y químicos actúan en el sistema Tierra y modifican el paisaje terrestre, generan recursos naturales y peligros; lo anterior es posible de alcanzar a través de una observación sistemática, toma de datos en terreno o trabajo con datos, con su respectivo análisis e interpretación. \r\n\r\nEste curso se ubica en el V semestre del plan de formación, al inicio del ciclo de especialidad (licenciatura); introduce a los y las estudiantes a las diversas disciplinas que componen la geología. Al final de este curso, el/la estudiante aplican sus conocimientos adquiridos para plantear soluciones a problemas geológicos simples relacionados con las distintas áreas de la geología, considerando como estos afectan e interactúan con la actividad humana.",
      "requirements": [
        "MA2002",
        "FI2004",
        "IQ2212"
      ],
      "equivalences": [
        "GL31A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3578",
      "weekly_modules": {
        "labs": 2,
        "lectures": 2,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "GF3103",
      "name": "Introducción a la Meteorología",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 27,
      "approval_rate": 0.96,
      "purpose": "El curso tiene como propósito que los y las estudiantes relacionen los principios físicos de conservación que gobiernan la atmósfera terrestre con ciertos fenómenos meteorológicos, a fin de explicarlos y predecir estados futuros de la atmósfera.\r\n\r\nAdemás, el y la estudiante determinan la importancia del rol de la atmósfera en el sistema climático y adquieren conocimientos relevantes para la cuantificación de energía solar y eólica. Estas habilidades aportan al pensamiento sistémico requerido en el contexto de la sustentabilidad y del desarrollo sostenible.",
      "requirements": [
        "MA2002"
      ],
      "equivalences": [
        "GF3101",
        "GF3003"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6608",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF4005",
      "name": "Matemáticas Aplicadas a la Geociencia",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 10,
      "approval_rate": 0.91,
      "purpose": "El curso tiene como propósito entregar a los y las estudiantes las bases teóricas, con énfasis en la aplicación, de los métodos matemáticos de la física-matemática para que el y la estudiante resuelvan ecuaciones a derivadas parciales, sujetas a condiciones de borde e iniciales, utilizando el contexto de la geofísica lo que le permite enfrentarse a problemas simples y complejos de la disciplina, proponiendo soluciones viables.",
      "requirements": [
        "MA3403",
        "MA3401"
      ],
      "equivalences": [
        "FI3002"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3598",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "FI3104",
      "name": "Métodos Numéricos para la Ciencia e Ingeniería",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 45,
      "approval_rate": 0.92,
      "purpose": "Cuando la solución analítica a un problema científico no existe o es muy compleja, el uso de computadoras y métodos numéricos apropiados pueden permitir encontrar la solución al problema planteado. Asimismo, en ciencias experimentales los datos obtenidos deben ser procesados y analizados, mediante el uso de distintos métodos numéricos, seleccionándolos de acuerdo a las ventajas y limitaciones de cada uno.\r\n\r\nEn este contexto, el curso tiene como propósito que los y las estudiantes resuelvan problemas de cálculo numérico para ciencias e ingeniería, programando y diseñando códigos computacionales simples mediante el uso de librerías numéricas que selecciona según criterios de velocidad, memoria, facilidad de uso y versatilidad o mediante la implementación de algoritmos.",
      "requirements": [
        "MA2002",
        "FI2002",
        "CC1002"
      ],
      "equivalences": [
        "MA33A",
        "FI46A",
        "MA367"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3470",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "IN3171",
      "name": "Modelamiento y Optimización",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 93,
      "approval_rate": 0.86,
      "purpose": "El curso, que se ubica en el V semestre de la licenciatura, tiene como propósito que los y las estudiantes identifiquen y analicen problemas de optimización y que construyan modelos que permita mejorar la eficiencia en la toma de decisiones. Para ello, utilizan herramientas tecnológicas diseñadas para obtener soluciones frente a diversos problemas.\r\n\r\nLa importancia de este curso radica en el hecho de que aporta a la formación de los y las estudiantes al proveer herramientas conceptuales que permiten identificar situaciones a las que se debe dar solución o que pueden ser mejoradas. Estos aprendizajes son transeversales a la formación, puesto que el/la estudiante pueden determinar cuáles son las falencias en el proceso de toma de decisiones frente a un problema o qué procesos pueden ser mejorados.",
      "requirements": [
        "MA2002"
      ],
      "equivalences": [
        "IN3701"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=70165",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA3701",
      "name": "Optimización",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 78,
      "approval_rate": 0.87,
      "purpose": "El propósito de este curso es que el/la estudiante resuelva problemáticas que aparecen en el\r\nmodelamiento de problemas de ingeniería con herramientas de optimización lineal y\r\nno-lineal tanto continua como entera, con o sin restricciones, usando los algoritmos y\r\npaquetes computacionales más adecuados.",
      "requirements": [
        "MA2002"
      ],
      "equivalences": [
        "MA37A",
        "MA3711"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3605",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "FI3001",
      "name": "Vibraciones y Ondas",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 39,
      "approval_rate": 0.79,
      "purpose": "Este curso se desarrolla durante el quinto semestre de la Licenciatura en Ciencias mención Física. El propósito del curso es que los y las estudiantes comprendan, internalicen y apliquen los conceptos asociados a oscilaciones en sistemas discretos y ondas en sistemas continuos para predecir los comportamientos de diversos sistemas físicos, utilizando herramientas como la dinámica lagrangiana discreta, modos normales y densidades lagrangiana. Estos conceptos son básicos y fundamentales para describir una amplia variedad de sistemas físicos.\r\nLa metodología de este curso está basada en clases expositivas, en resolución de problemas (tareas y ejercicios) relacionados con los contenidos del curso y en actividades demostrativas experimentales para demostrar los conceptos aprendidos en el curso.",
      "requirements": [
        "MA2002",
        "FI2001",
        "FI2002"
      ],
      "equivalences": [
        "FI21B"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3466",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF4029",
      "name": "Análisis de Señales",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 15,
      "approval_rate": 0.95,
      "purpose": "El curso tiene como propósito introducir a los y las estudiantes en el procesamiento de datos geofísicos. Se espera que el y la estudiante usen herramientas matemáticas que le permitan manipular este tipo de datos. \r\n\r\nEste curso a través de diferentes estrategias logrará que el y la estudiante apliquen conceptos básicos y avanzados para el manejo de datos geofísicos y extraer información relevante. Los y las estudiantes trabajarán con datos reales obtenidos de diferentes fuentes.",
      "requirements": [
        "GF3001",
        "FI3104"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=4368",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF4022",
      "name": "Mecánica de Fluidos Aplicada a la Geociencia",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 8,
      "approval_rate": 0.82,
      "purpose": "El curso tiene como propósito que los y las estudiantes utilicen conceptos de la mecánica de fluidos para modelar los flujos en la astenósfera y atmósfera.\r\nComprender los flujos astenosféricos es primordial para entender el funcionamiento de la tectónica de placas, que es la causa de grandes procesos geofísicos tales como terremotos, erupciones volcánicas y orogénesis.\r\n\r\nAsimismo, entender el comportamiento de los flujos atmosféricos es de gran relevancia para inferir el funcionamiento del clima y de fenómenos meteorológicos de distintas escalas.",
      "requirements": [
        "GF4005"
      ],
      "equivalences": [
        "GF4021"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=89046",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF4001",
      "name": "Sismología",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 28,
      "approval_rate": 0.93,
      "purpose": "El curso tiene como propósito introducir a los y las estudiantes en el estudio de la sismología y se espera que utilicen conceptos de la geofísica tales como placas tectónicas, terremotos, hipocentro, magnitud, ondas sísmicas, peligro sísmico y técnicas básicas de esta disciplina, en aplicaciones simples que les permitirán cuantificar las variables físicas asociadas al fenómeno terremoto.\r\n\r\nLa estrategia metodológica es participativa, con clases presenciales en donde el y la estudiante trabajarán en actividades que les permitirán utilizar datos reales de sismos ocurridos en Chile y en otras partes del mundo, que serán trabajados durante el curso.",
      "requirements": [
        "MA2002",
        "FI2002"
      ],
      "equivalences": [
        "GF40A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3473",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF3004",
      "name": "Sistema Climático",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 16,
      "approval_rate": 0.95,
      "purpose": "El curso tiene como propósito que los y las estudiantes evalúen el funcionamiento del planeta tierra a lo largo de toda su evolución en relación al clima terrestre; esto incluye: su formación, las condiciones para la vida, variabilidad climática a distintas escalas de tiempo y cambio climático actual. \r\n\r\nPara esto, analizan los procesos que controlan la dinámica del sistema terrestre a lo largo de toda su evolución, utilizando modelos computacionales del clima, a fin de realizar una evaluación crítica del efecto de los forzantes humanos y naturales sobre el sistema y la atmósfera terrestre. Asimismo, aplica los fundamentos y funcionamiento del sistema climático al cambio climático actual, distinguiendo forzantes humanos y naturales.\r\n\r\nLa metodología de trabajo se divide entre clases lectivas, lecturas de artículos científicos en inglés, laboratorios computacionales y un trabajo de investigación con presentación oral final. Hay un especial énfasis en el análisis crítico sobre estas materias.",
      "requirements": [
        "FI2004",
        "IQ2212"
      ],
      "equivalences": [
        "GF3011"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3476",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF4004",
      "name": "Geodinámica",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 13,
      "approval_rate": 0.91,
      "purpose": "El curso tiene como propósito que el y la estudiante utilicen conceptos del funcionamiento y dinámica del interior de la Tierra para explicar los fenómenos geodinámicos desde una perspectiva cuantitativa e interpretativa. \r\n\r\nEste curso entrega la base para que el y la estudiante usen los conceptos de funcionamiento y dinámica del interior de la Tierra en estudios de la deformación cortical y aplicaciones de la mecánica de fluido a problemas geológicos. Además realizarán diversas tareas computacionales en donde los y las estudiantes podrán modelar e interpretar procesos geodinámicos.",
      "requirements": [
        "GF3001",
        "FI3001"
      ],
      "equivalences": [
        "GF41D"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3599",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF5013",
      "name": "Métodos Inversos Aplicados a la Geofísica",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 11,
      "approval_rate": 0.95,
      "purpose": "El curso tiene como propósito que los y las estudiantes apliquen métodos de optimización y Bayesianos a fin de resolver problemas inversos discretos. Asimismo, utilizan observaciones experimentales para estimar parámetros de modelos matemáticos que representan fenómenos físicos. Para ello, el y la estudiante manejan conceptos básicos y alcances de la teoría de problemas inversos discretos lineales y no-lineales, así como metodologías de resolución optimales y Bayesianas.\r\n\r\nEn el curso se verán ejemplos de aplicación de las metodologías aprendidas, que incluyen desde modelos matemáticos simples hasta problemas físicos más complejos con énfasis en temáticas de las ciencias de la tierra.",
      "requirements": [
        "MA3403",
        "MA3401",
        "MA3701",
        "IN3171",
        "GF4001"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=4363",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF4006",
      "name": "Métodos de Exploración Geofísica",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 17,
      "approval_rate": 0.78,
      "purpose": "El curso tiene como propósito que los y las estudiantes manejen conceptos básicos de los métodos geofísicos actualmente empleados en la exploración del subsuelo, como métodos gravimétrico, magnético, sísmico y eléctrico comúnmente usados en temas tales como prospección minera o petrolera, estudio de suelos, prospección de aguas y estudio de estructuras geológicas a escala regional. El y la estudiante se familiarizan con el procesamiento e interpretación de los datos obtenidos, en base a modelos físico  matemáticos de las variables físicas en juego.\r\n\r\nAdemás, el y la estudiante logran familiarizarse con el instrumental geofísico y la aplicación en terreno de cada uno de los métodos tratados en clase. En este curso se realizará al menos una salida de terreno.\r\n\r\nLa metodología del curso es activa. Se promueve una mayor responsabilidad y autorregulación de los y las estudiantes acerca de las materias trabajadas. El o la docente, por su parte, actúa como mediador de todo este proceso, promoviendo la discusión y reflexión sobre lo tratado en clases.",
      "requirements": [
        "GF4001",
        "FI3001"
      ],
      "equivalences": [
        "GF42A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3767",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 7,
      "code": "GF4901",
      "name": "Práctica Profesional I",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 5,
      "approval_rate": 0.93,
      "purpose": "En el contexto del rediseño curricular de la formación en Ingeniería y Ciencias, las\r\nprácticas profesionales han sido definidas como hitos evaluativos del Perfil de\r\negresode la carrera de la FCFM, pues ellas corresponden a actividades curriculares\r\nque permiten evidenciar y monitorear el logro de una serie de competencias\r\nrelevantescomprometidas en dicho perfil. Además, permite darle la posibilidad a\r\nlos/las estudiantes de demostrar de manera auténtica los logros desarrollados en\r\nsu formación hasta el momento en donde se ubica la práctica según plan de estudio.\r\n\r\nPor tanto, en cada práctica profesional el/la estudiante cumple un rol central y\r\nprotagónico, pues tendrá la oportunidad para demostrar desempeños tanto de las\r\ncompetencias específicas de su formación como de las competencias genéricas\r\ntalescomo trabajo en equipo, comunicación académica y profesional, compromiso\r\nético einnovación.\r\n\r\nPor otra parte, las prácticas profesionales constituyen una valiosa oportunidad\r\npara vincular la universidad con la empresa a través de los/as estudiantes",
      "requirements": [
        "GF3001",
        "GL3101"
      ],
      "equivalences": [
        "GF49A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3792",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 14,
      "code": "GF5901",
      "name": "Práctica Profesional II",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 2,
      "approval_rate": 0.67,
      "purpose": "En el contexto del rediseño curricular de la formación en Ingeniería y Ciencias, las\r\nprácticas profesionales han sido definidas como hitos evaluativos del Perfil de egreso de\r\ncada carrera en la FCFM, pues las prácticas corresponden a actividades curriculares que\r\npermiten evidenciar y monitorear el logro de una serie de competencias relevantes\r\ncomprometidas en dicho perfil. Además, permite darle la posibilidad a los/las estudiantes\r\nde demostrar de manera auténtica los logros desarrollados durante su formación de\r\nacuerdo a la etapa en la que se encuentren.\r\n\r\nPor tanto, en cada práctica profesional el/la estudiante cumple un rol central y\r\nprotagónico, pues tendrá la oportunidad para demostrar desempeños tanto de las\r\ncompetencias específicas de su formación como de las competencias que en el caso de la\r\nCarrera de Geofísica corresponden a la comunicación académica y profesional,\r\ncomunicación en inglés, compromiso ético, trabajo en equipo y sustentabilidad. Esta es la\r\nsegunda práctica y considera desempeños observables, considerando el avance curricular\r\ndel/la estudiante.\r\n\r\nPor otra parte, las prácticas profesionales constituyen una valiosa oportunidad para\r\nvincular a la Universidad con empresas públicas y privadas, a través de sus estudiantes.\r\nAsimismo, los estudiantes de ambas menciones de la carrera, tanto de Tierra Sólida como\r\nde Atmósfera, tendrán la oportunidad de poner en práctica el desarrollo de competencias\r\nespecíficas a sus especialidades, en relación con el diseño y evaluación de proyectos\r\ngeofísicos.",
      "requirements": [
        "GF4901"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=160594",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 3,
      "code": "GF4024",
      "name": "Sistemas de Observación",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 8,
      "approval_rate": 0.87,
      "purpose": "El curso tiene como propósito que los y las estudiantes manejen equipos geofísicos de medición, comprendiendo su funcionamiento, identificando las variables geofísicas medidas cuantificando los errores en la medición, de manera de caracterizar fenómenos naturales, con el fin de explicar procesos físicos en la atmósfera y tierra sólida, así como explorar y cuantificar recursos naturales asociados a los procesos geofísicos.",
      "requirements": [
        "GF3004",
        "GF4001",
        "GF3103"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=89050",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF3005",
      "name": "Contaminación Atmosférica",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 6,
      "approval_rate": 0.92,
      "purpose": "El curso tiene como propósito que los y las estudiantes conceptualicen los procesos que determinan la evolución física y química, así como la dispersión de trazas atmosféricas: emisiones, mezcla y transporte, química atmosférica, deposición húmeda y seca. \r\n\r\nTambién habrán adquirido experiencia en la utilización e interpretación de modelos numéricos para explicar procesos, con énfasis en problemas de contaminación urbana y en torno a megafuentes. Con todo, los y las estudiantes podrán relacionar procesos naturales y antrópicos con la emisión de contaminantes primarios y la producción de contaminantes secundarios.",
      "requirements": [
        "GF3103"
      ],
      "equivalences": [
        "GF3022"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=116538",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 3,
      "code": "GF3024",
      "name": "Peligros Naturales",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 6,
      "approval_rate": 1.0,
      "purpose": "El curso tiene como propósito que los y las estudiantes determinen los elementos, relaciones y propiedades que operan en el Sistema Tierra, para comprender los procesos involucrados en las diferentes escalas espaciales y temporales, así como los aspectos que inciden en la percepción, exposición y vulnerabilidad de la sociedad, que permitan elaborar propuestas sustentables orientadas a la reducción de riesgos de desastres. Este curso es una instancia para que el y la estudiante puedan desarrollar una mirada integral acerca de la gestión del riesgo de desastres en Chile, determinando los grandes desafíos a los que nos enfrentamos como país. La vigencia de este tema y su gran impacto social requieren de una participación activa de los diferentes niveles de la comunidad, y para ello se necesitan ciudadanos y ciudadanas formados en estos temas, conscientes de su responsabilidad y capaces de formular una visión critica de la situación del país y de los cambios que están siendo debatidos.\r\n\r\nEl curso contempla un trabajo que incluye aplicaciones prácticas sobre la gestión de riesgos con el fin de consolidar las capacidades de los y las estudiantes en cuanto al diálogo, análisis y trabajo en equipo. Finalmente, al consolidar sus conocimientos sobre el estado de la cuestión en materia de gestión de riesgos de desastres, el y la estudiante elaboran un análisis critico propio en torno a una problemática país, donde la participación de todos es fundamental. \r\n\r\nLa metodología del curso es participativa. Se promueve con ello una mayor responsabilidad y autorregulación de los y las estudiantes acerca de las materias trabajadas. El y la estudiante enfrentan un desafío al construir un análisis crítico en torno a un problema país respecto de la falta de planificación y gestión de riesgos previo a la ocurrencia del evento, para luego proponer una solución en la prevención de desastres, considerando datos y métodos de ordenamiento territorial. El o la docente, por su parte, actúa como mediador de todo este proceso, promoviendo la discusión y reflexión sobre lo tratado en clases y lo trabajado en las discusiones, debates. Asimismo, aclara dudas, orienta el quehacer del y la estudiante.",
      "requirements": [
        "GF4024",
        "GF4006"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=153318",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF5023",
      "name": "Termodinámica Atmosférica",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 7,
      "approval_rate": 0.95,
      "purpose": "El curso Termodinámica atmosférica tiene como propósito que los y las estudiantes apliquen los fundamentos de la física para interpretar los procesos termodinámicos de la atmósfera, incluyendo su termodinámica, estabilidad y microfísica de nubes.",
      "requirements": [
        "GF5013"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=135786",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF5022",
      "name": "Dinámica de la Atmósfera",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 8,
      "approval_rate": 0.96,
      "purpose": "El curso Dinámica de la atmósfera tiene como propósito que los y las estudiantes evalúen la importancia de las fuerzas que producen movimiento en la atmósfera y su incidencia relativa en los principales balances a escala sinóptica y gran escala.\r\n\r\nDesde un enfoque analítico y comprensivo, los y las estudiantes aplican los elementos fundamentales de la dinámica de la atmósfera (Leyes de conservación y análisis de escala, efectos de la superficie, circulación y vorticidad) a los fenómenos específicos de la dinámica atmosférica (perturbaciones extratropicales de escala sinóptica y su origen baroclínico, ondas atmosféricas entre otras).\r\n\r\nSe espera que los y las estudiantes desarrollen una investigación guiada para profundizar aspectos de su propio interés relacionados con la dinámica atmosférica.",
      "requirements": [
        "GF3024"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=135778",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF5030",
      "name": "Quimica Atmosférica y Clima",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 4,
      "approval_rate": 1.0,
      "purpose": "El curso tiene como propósito que los y las estudiantes conceptualicen los procesos a través de los cuales ciclos biogeoquímicos, trazas químicas reactivas y sus precursores, así como aerosoles primarios y secundarios participan en el forzamiento radiativo de la Tierra y a su vez son afectados por la variabilidad y cambio climático.",
      "requirements": [
        "GF3005"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=153502",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "GF5019",
      "name": "Radiación y percepción remota",
      "department": {
        "name": "Departamento de Geofísica",
        "code": "DGF",
        "id": 15
      },
      "students_per_course": 8,
      "approval_rate": 0.95,
      "purpose": null,
      "requirements": [
        "GF3024"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=174446",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "plancfb0b537e9c0fa65517e37fbb768cff5",
      "name": "Licenciatura Electivos Geofísica V5",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 18,
      "code": "plan66b0ee152101ee9e4413047ada120af0",
      "name": "Electivos Especialidad Geofísica V5",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 18 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "plan6ddb06e046ce60226fe3c7d9e855fecb",
      "name": "Trabajo de Habilitación Profesional I Geofísica V5",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 12,
      "code": "plan7cc6a464d2e2f2ef5324babd8f580e7c",
      "name": "Trabajo de Habilitación Profesional II Geofísica V5",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 12 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "plane6d168d5af03dfd21402c7b04eab2ebf",
      "name": "Formación Integral Licenciatura (FG/EH)",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "plan2128839706dc6a9ce2a7bf329f96b0ef",
      "name": "FI2004/IQ2212",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "plan49accd70cb61bdce739951bcd1bea145",
      "name": "Formación Integral (FG/EH/EI/DR/FT)",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    }
  ]
}