{
  "name": "Ingeniería Civil Mecánica",
  "version": 4,
  "courses": [
    {
      "credits": 6,
      "code": "CC1001",
      "name": "Computación I",
      "department": {
        "name": "Departamento de Ciencias de la Computación",
        "code": "DCC",
        "id": 5
      },
      "students_per_course": 80,
      "approval_rate": 0.86,
      "purpose": null,
      "requirements": [],
      "equivalences": [
        "CC100",
        "CC10A",
        "CC151"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3448",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "IN42A",
      "name": "Evaluación de Proyectos",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 71,
      "approval_rate": 0.86,
      "purpose": null,
      "requirements": [
        "EI19A",
        "EH09A",
        "IN41A",
        "IN34A",
        "MA37A"
      ],
      "equivalences": [
        "IN4301"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=668",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 0,
      "code": "EI1090",
      "name": "Examen de Suficiencia en Inglés I",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 336,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [],
      "equivalences": [
        "EI19A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=16498",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "EL4204",
      "name": "Formulación y Evaluación de Proyectos",
      "department": {
        "name": "Departamento de Ingeniería Eléctrica",
        "code": "DIE",
        "id": 10
      },
      "students_per_course": 47,
      "approval_rate": 0.98,
      "purpose": "El curso tiene como propósito que los y las estudiantes formulen y evalúen proyectos de inversión públicos y privados en ingeniería eléctrica, con sus respectivas etapas y componentes, integrando a su formulación criterios técnicos, económicos, sociales, ambientales y éticos.\r\n\r\nAsimismo, los y las estudiantes calculan indicadores de rentabilidad de un proyecto en ingeniería eléctrica, desde una perspectiva privada y social, a fin de determinar su viabilidad.\r\n\r\nLa metodología del curso permite que el estudiante construya de manera activa su aprendizaje. Esto incluye un trabajo que une teoría y práctica, aplicable a casos, con ejemplos reales y significativos.",
      "requirements": [
        "EL4115"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=115630",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 3,
      "code": "CC1000",
      "name": "Herramientas Computacionales para Ingeniería y Ciencias",
      "department": {
        "name": "Departamento de Ciencias de la Computación",
        "code": "DCC",
        "id": 5
      },
      "students_per_course": 47,
      "approval_rate": 0.98,
      "purpose": "El curso Herramientas Computacionales para Ingeniería y Ciencias tiene por finalidad asegurar que todos los estudiantes, independientemente de sus conocimientos previos, logren un nivel de manejo de las herramientas computacionales básicas tales como: Excel, R, MATLAB, Maple, LaTeX, entre otros, que permita la resolución de problemas simples de la ingeniería y ciencias.\r\n\r\nEl curso es eminentemente práctico y se orienta a la resolución de problemas, motivando la introducción de las herramientas necesarias para resolverlos, y profundizando en las características de estas herramientas a medida que los problemas planteados lo requieren.",
      "requirements": [],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=4593",
      "weekly_modules": {
        "labs": 1,
        "lectures": 1,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "MA1101",
      "name": "Introducción al Álgebra",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 93,
      "approval_rate": 0.75,
      "purpose": "El curso Introducción al Álgebra tiene como propósito desarrollar la habilidad de abstracción y de razonamiento lógico del estudiante, familiarizándolo con el lenguaje matemático básico de forma que lo comprenda y lo utilice para formular, escribir y demostrar proposiciones matemáticas simples, obteniendo, de esta forma, herramientas fundamentales para los cursos de ciencias e ingeniería posteriores.\r\n\r\nAsimismo, el curso brinda las herramientas necesarias para que el estudiante utilice técnicas de demostración como la inducción, demostraciones directas e indirectas, demostraciones por casos, y demostraciones por reducción al absurdo.\r\n\r\nPara entender el lenguaje matemático básico el estudiante debe ser capaz de comprender la lógica simbólica, el álgebra de conjuntos, las nociones de función y relación, conceptos básicos de conteo y estructuras algebraicas, adquiriendo soltura en la manipulación y operación de proposiciones, cuantificadores, conjuntos, sumatorias, números complejos y polinomios.",
      "requirements": [],
      "equivalences": [
        "MA110"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3533",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA1001",
      "name": "Introducción al Cálculo",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 92,
      "approval_rate": 0.75,
      "purpose": "El curso MA1001, Introducción al Cálculo, entrega las herramientas y conceptos básicos que el estudiante requiere para seguir la línea de cursos de cálculo en Plan común. El curso provee además una primera aproximación a la rigurosidad necesaria en los cursos matemáticos del Plan Común.\r\nEl curso comienza con algunos complementos a la formación básica de los estudiantes en matemáticas, incluyendo contenidos de propiedades de los números reales, geometría analítica y trigonometría. La mayor parte del curso se enfoca en establecer los conceptos básicos que subyacen al cálculo diferencial e integral, incluyendo funciones de una variable real, el estudio de límites de sucesiones, límites de funciones y cálculo de asíntotas. Finalmente se introducen el concepto y la operatoria de derivadas, que son estudiadas en mayor detalle en el siguiente curso de la Línea de Cálculo.\r\nLa metodología de trabajo incluye clases de cátedra expositivas y clases auxiliares enfocadas en el desarrollo y la resolución de problemas por parte de los estudiantes con apoyo del equipo docente.\r\nSe espera que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o Código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [],
      "equivalences": [
        "MA100"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=12398",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "FI1001",
      "name": "Introducción a la Física Newtoniana",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 85,
      "approval_rate": 0.88,
      "purpose": "El estudiante al termino del curso demuestra que:\r\n\r\n1.\tIdentifica las variables, como posición, velocidad y aceleración, que describen el movimiento de sistemas mecánicos simples, a fin describir su evolución temporal. \r\n2.\tIdentifica y utiliza algunas fuerzas simples, como el peso, normal, tensión, fuerza de roce, gravitación, con el fin de describir la mecánica de sistemas físicos. \r\n3.\tUtiliza representaciones gráficas de las variables que describen el movimiento de una partícula para interpretar su comportamiento. \r\n4.\tAplica las Leyes de Newton a sistemas mecánicos simples de una o dos partículas para poder describir su dinámica.\r\n5.\tReconoce el rango de aplicabilidad y/o restricciones de los principios de conservación del momentum y de la energía para describir la dinámica de sistemas mecánicos simples.",
      "requirements": [],
      "equivalences": [
        "FI100",
        "FI1000"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3491",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 3
      }
    },
    {
      "credits": 3,
      "code": "EI1101",
      "name": "Introducción a la Ingeniería I",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 90,
      "approval_rate": 0.99,
      "purpose": "Al término del curso el alumno demuestra que desarrolla proyectos de diseño en ingeniería, ejercita la creatividad, refuerza la motivación por el aprendizaje de las matemáticas y la ciencia mediante la aplicación de los conocimientos básicos a la solución de problemas de ingeniería, reversa y de procesos, en un marco ético. También demuestra poseer habilidades personales e interpersonales",
      "requirements": [],
      "equivalences": [
        "EI110"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3445",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 3,
      "code": "EI1102",
      "name": "Introducción a la Ingeniería II",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 81,
      "approval_rate": 0.99,
      "purpose": "Al término del curso el alumno demuestra que desarrolla proyectos de diseño en ingeniería,\r\nejercita la creatividad, refuerza la motivación por el aprendizaje de las matemáticas y la ciencia\r\nmediante la aplicación de los conocimientos básicos a la solución de problemas de ingeniería,\r\nreversa y de procesos, en un marco ético. También demuestra poseer habilidades personales e\r\ninterpersonales.",
      "requirements": [],
      "equivalences": [
        "EI1B2"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3446",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME4602",
      "name": "Proyecto Mecánico I",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 24,
      "approval_rate": 0.88,
      "purpose": null,
      "requirements": [
        "ME3202"
      ],
      "equivalences": [
        "ME46B"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3563",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "CM1001",
      "name": "Química",
      "department": {
        "name": "Departamento de Ciencia de los Materiales",
        "code": "CM",
        "id": 306
      },
      "students_per_course": 77,
      "approval_rate": 0.88,
      "purpose": "Al final del curso el estudiante demuestra que:\r\n Maneja y aplica los conocimientos básicos de la química en problemas\r\nque se le planteen en su especialidad.\r\n Comprende los procesos químicos sobre la base del conocimiento\r\nmicroscópico de la materia.\r\n Descubre la importancia de estos conocimientos en el desarrollo\r\ncientífico y tecnológico del mundo moderno.\r\n Comprende y describe la estructura y propiedades de la materia.\r\n Calcula y resuelve problemas relacionados con las condiciones para la\r\ntransformación de la materia y la velocidad con que ésta ocurre.",
      "requirements": [],
      "equivalences": [
        "CM1A1",
        "QI21A",
        "QI212"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6000",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA1102",
      "name": "Álgebra Lineal",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 89,
      "approval_rate": 0.89,
      "purpose": "El propósito de este curso es proporcionar los conocimientos fundamentales del álgebra lineal desde un punto de vista teórico y práctico, con un énfasis especial en tópicos que serán relevantes para cursos posteriores en la comprensión y modelamiento de fenómenos lineales, y en la aproximación de fenómenos no lineales.\r\n\r\nSe espera que el estudiante comprenda las operaciones básicas de matrices, sus propiedades y su relación con distintos problemas del álgebra lineal y otras aplicaciones; que asimile el concepto de espacio vectorial y conozca ejemplos importantes que se aplicarán en cursos posteriores; que comprenda y conozca los principales resultados asociados a subespacios vectoriales y dimensión; que comprenda la geometría de espacios vectoriales reales y complejos y conceptos como ortogonalidad, paralelismo y proyecciones; y que asimile el concepto de transformaciones lineales definidas en espacios vectoriales de dimensión finita, que comprenda su representación a través de matrices, que calcule sus valores y vectores propios y que, cuando sea posible, obtenga su forma diagonal.\r\nSe espera que el estudiante actúe en las actividades que se le \r\n proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas",
      "requirements": [
        "MA1101",
        "MA110"
      ],
      "equivalences": [
        "MA1B2"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3462",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA1002",
      "name": "Cálculo Diferencial e Integral",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 94,
      "approval_rate": 0.77,
      "purpose": "El propósito de este curso es proporcionar los conocimientos fundamentales del cálculo en una variable real. Se espera que el estudiante asimile los conceptos de derivada y de integral, así como la relación entre ambos conceptos dado por el Teorema Fundamental del Cálculo. \r\n\r\nGran parte del curso se enfoca en el uso de las derivadas para estudiar el comportamiento de las funciones reales en una variable real; y en la aplicación de las integrales para el cálculo de áreas, volúmenes de revolución y centros de masa de curvas, entre otros, que son elementales para el planteamiento y resolución de problemas en ingeniería. El curso concluye con el tratamiento de integrales impropias, series infinitas, series de potencia y un estudio inicial de curvas en el espacio.\r\nSe espera que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [
        "MA1001",
        "MA100"
      ],
      "equivalences": [
        "MA1A2"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3459",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 0,
      "code": "EI2090",
      "name": "Examen de Suficiencia en Inglés II",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 203,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [
        "EI1090"
      ],
      "equivalences": [
        "EI29A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=16502",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 3,
      "code": "ME6908",
      "name": "Introducción al Trabajo de Título",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 32,
      "approval_rate": 0.85,
      "purpose": "Al final del curso ME6908, el o la estudiante debe definir, con el apoyo de un profesor guía, el Temario de su Trabajo de Título y obtener la aprobación de tal temario por parte de la Comisión Examinadora asignado al o el alumno/a.\r\n\r\nEste temario deberá corresponder al desarrollo de un proyecto profesional original o una investigación, el que será desarrollado en el curso Trabajo de Titulo o en el curso de Memoria de Titulo; dicho temario se deberá presentar en correcta forma escrita y oral.\r\n\r\nSe espera que el/la estudiante demuestre los siguientes logros:\r\n\r\n-Planifica y desarrolla su propio trabajo, lo que involucra encontrar un profesor guía, definir su tema de titulación, coordinarse con el profesor guía para discutir el trabajo, y liderar las fases de propuesta y planificación de su trabajo.\r\n-Trabaja, siguiendo una metodología que considere la identificación de un problema en la revisión del estado del arte asociado a dicho problema, el diseño preliminar de una solución eficiente y efectiva, y la planificación del trabajo necesario para desarrollar y evaluar la solución en el contexto del problema identificado.\r\n-Analiza información que selecciona de la búsqueda de literatura u otras fuentes relevantes para el trabajo, considerando el estado del arte atingente al problema en estudio, como base para su marco teórico, gestionando su tiempo respecto a los plazos.\r\n-Redacta, a mediados de semestre, un resumen preliminar de hasta 250 palabras sobre el tema de investigación o proyecto, explicando la pertinencia y alcance de este y considerando en su escrito claridad, precisión y capacidad de síntesis. \r\n-Presenta una exposición breve de cinco minutos sobre los avances de su trabajo de investigación, considerando claridad, coherencia y síntesis frente a lo expuesto.\r\n-Redacta un informe final donde se presente en forma clara y concisa la motivación, los objetivos, el estado del arte, la planificación y los recursos requeridos para el desarrollo de un proyecto profesional o una investigación original.\r\n-Expone, en forma oral, a modo de examen, la motivación, los objetivos, la revisión bibliográfica y la metodología a utilizar para abordar su proyecto profesional o investigación original, planteando argumentos técnico-disciplinarios que sustenten la propuesta y evidenciando, en su discurso, claridad, uso de un lenguaje variado y precisión conceptual, adecuándose al tipo de audiencia.",
      "requirements": [
        "CR270"
      ],
      "equivalences": [
        "ME69E"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6036",
      "weekly_modules": {
        "labs": 0,
        "lectures": 1,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "CC1002",
      "name": "Introducción a la Programación",
      "department": {
        "name": "Departamento de Ciencias de la Computación",
        "code": "DCC",
        "id": 5
      },
      "students_per_course": 83,
      "approval_rate": 0.89,
      "purpose": "Este curso tiene por finalidad que los estudiantes resuelvan problemas de baja complejidad,\r\nsiguiendo una ruta metodológica y generando programas capaces de dar respuestas a las\r\ndistintas peticiones y finalidades de éstos. Los problemas estarán definidos en diversos\r\ndominios de aplicación, pudiendo tener representación en el ámbito de la ingeniería. Los\r\nestudiantes podrán centrarse fundamentalmente en el desarrollo de una metodología de\r\ntrabajo que los llevará a adquirir rigor procedimental para enfrentarse a la resolución de estas\r\ntareas en base al razonamiento algorítmico y lógico. Por ello, las clases tendrán una estructura\r\nteórico-práctica en las que se introducirán las nuevas temáticas a partir de problemas\r\nseleccionados y se contará con orientaciones metodológicas por parte de los ayudantes de la\r\ncátedra",
      "requirements": [],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=5571",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "FI1002",
      "name": "Sistemas Newtonianos",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 78,
      "approval_rate": 0.9,
      "purpose": "Al final el estudiante demuestra que:\r\n Comprende fenómenos que involucren sólidos, fluidos y medios elásticos. Lo\r\nanterior en el marco de las leyes de Newton extendidas a sistemas más complejos.",
      "requirements": [
        "FI1001",
        "FI100",
        "CC1001",
        "CC100",
        "CC1000",
        "MA1001",
        "MA100"
      ],
      "equivalences": [
        "FI1A2",
        "FI1100"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3453",
      "weekly_modules": {
        "labs": 3,
        "lectures": 2,
        "auxs": 2
      }
    },
    {
      "credits": 3,
      "code": "EI2001",
      "name": "Taller de Proyecto",
      "department": {
        "name": "Escuela de Ingeniería",
        "code": "EI",
        "id": 27
      },
      "students_per_course": 18,
      "approval_rate": 0.98,
      "purpose": "Al término del curso el alumno demuestra que concibe, diseña, implementa y opera\r\nproyectos de ingeniería, dando respuesta innovadora a una necesidad real en un área\r\nespecífica de aplicación.",
      "requirements": [
        "EI1102",
        "CC10A",
        "CC10B"
      ],
      "equivalences": [
        "EI2A1",
        "SD20A",
        "SD15A",
        "ME160",
        "CD1201"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3451",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 21,
      "code": "ME6910",
      "name": "Trabajo de Memoria de Título",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 2,
      "approval_rate": 0.83,
      "purpose": null,
      "requirements": [],
      "equivalences": [
        "ME69H"
      ],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 21,
      "code": "ME6930",
      "name": "Trabajo de Memoria de Título",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 3,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [
        "CR300"
      ],
      "equivalences": [
        "ME6910"
      ],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 1,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "MA2001",
      "name": "Cálculo en Varias Variables",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 92,
      "approval_rate": 0.87,
      "purpose": "El propósito de este curso es proporcionar los conocimientos fundamentales del cálculo en varias variables reales.  Se espera que el estudiante asimile los conceptos de sucesiones, límites, continuidad, derivadas e integrales en varias variables. Además, se espera que el estudiante pueda usar estos conceptos para estudiar el comportamiento de funciones en varias variables y aplicarlos, por un lado, a problemas de modelamiento en los que se deba buscar máximos y mínimos, como una primera aproximación al posterior curso de Optimización, y por otro para el cálculo de volúmenes, masas y momentos de inercia que son fundamentales para la resolución de problemas en ingeniería. \r\nSe espera además que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [
        "MA1002",
        "MA1102"
      ],
      "equivalences": [
        "MA2A1",
        "MA22A",
        "MA220"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3463",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 3,
      "code": "ME3203",
      "name": "Dibujo Mecánico",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 21,
      "approval_rate": 0.87,
      "purpose": null,
      "requirements": [
        "EI2001",
        "EI1102",
        "CD1201"
      ],
      "equivalences": [
        "ME3120"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6039",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "MA2601",
      "name": "Ecuaciones Diferenciales Ordinarias",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 91,
      "approval_rate": 0.88,
      "purpose": "El propósito de este curso es proporcionar los conocimientos teóricos y prácticos necesarios para resolver familias específicas de ecuaciones diferenciales ordinarias (EDO) e interpretar las soluciones de estas en aplicaciones a las ciencias y a la ingeniería.\r\nSe espera que el estudiante actúe en las actividades que se le proponen de manera responsable y honesta, evitando por ejemplo el plagio, copia de sus pares u otras fuentes, así como cualquier comportamiento que vaya en contra de sus pares, equipo docente o código de ética y reglamentos de la Escuela de la Facultad de Ciencias Físicas y Matemáticas.",
      "requirements": [
        "MA1002",
        "MA1102"
      ],
      "equivalences": [
        "MA2G1",
        "MA26A",
        "MA261"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3531",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "FI2001",
      "name": "Mecánica",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 90,
      "approval_rate": 0.81,
      "purpose": "Este curso tiene como propósito que el estudiante utilice las leyes de la mecánica de Newton para modelar sistemas dinámicos constituidos por una o varias partículas.\r\nUn aspecto central del curso es lograr que el estudiante pueda resolver problemas de mecánica, utilizando las herramientas del cálculo diferencial e integral.  \r\nAl termino del curso el estudiante demostrará que:\r\nRA1: Modela sistemas compuestos por partículas en movimiento, identificando las variables cinemáticas (posición, velocidad y aceleración).\r\nRA2: Utiliza las leyes de Newton para obtener sistemas de ecuaciones diferenciales que describen el movimiento de sistemas compuestos por partículas y agentes externos.\r\nRA3: Predice el movimiento de sistemas de una o varias partículas, utilizando los conceptos de trabajo, energía, momentum angular y principio de mínima acción.\r\nRA4: Determina modos de oscilación y frecuencias normales de sistemas de una o más partículas en configuraciones cercanas al equilibrio estable.\r\nRA5: Realiza sus actividades académicas, basándose en sus capacidades, demostrando con ello honestidad en su comportamiento sin incurrir en plagio o copia.",
      "requirements": [
        "FI1100",
        "FI1002",
        "MA1002",
        "MA1102"
      ],
      "equivalences": [
        "FI2A1",
        "FI21A",
        "FI215"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3454",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 3
      }
    },
    {
      "credits": 6,
      "code": "FI2003",
      "name": "Métodos Experimentales",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 54,
      "approval_rate": 0.96,
      "purpose": "Este curso tiene como propósito que el estudiante desarrolle habilidades de trabajo experimental, utilizando metodologías experimentales generales y protocolos de seguridad. Para lograrlo, el curso se organiza principalmente en base a un conjunto de experiencias de electrónica básica, las cuales se realizan semanalmente en un laboratorio de física. Una clase teórica semanal permite introducir los conceptos de electrónica necesarios para interpretar los resultados experimentales.\r\nLas sesiones de laboratorio de este curso se desarrollan en equipos de trabajo. Cada equipo demuestra habilidades de comunicación escrita a través de los informes de laboratorios. Asimismo, demuestra compromiso ético cumpliendo con responsabilidad y honestidad frente a cada a tarea.",
      "requirements": [
        "MA1002",
        "FI1100"
      ],
      "equivalences": [
        "FI2A3",
        "FI25A",
        "FI35A",
        "FI2003E"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3494",
      "weekly_modules": {
        "labs": 3,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 21,
      "code": "ME6909",
      "name": "Trabajo de Título",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 14,
      "approval_rate": 0.91,
      "purpose": "El curso tiene como propósito que los y las estudiantes demuestren los logros que se indican a continuación, en el campo de la Ingeniería Mecánica, mediante el desarrollo de un proyecto profesional o una investigación, de acuerdo con el temario aprobado en el curso ME6908, Introducción al Trabajo de Título. Eventuales ajustes, generados durante el curso ME6909, de los objetivos establecidos en dicho documento, deberán ser refrendados por el Comité de Titulación del Departamento de Ingeniería Mecánica, a solicitud formal del Profesor Guía y del o de la estudiante respectivo(a).\r\n\r\nSe espera que el/la estudiante demuestre los siguientes logros, en el campo de la Ingeniería Mecánica:\r\n\r\n❑\tPropone posibles soluciones, a partir del planteamiento de un tema de ingeniería o una pregunta de investigación.\r\n❑\tAnaliza, de manera crítica, los procesos de desarrollo de soluciones en problemas de investigación y/o de ingeniería.\r\n❑\tAplica metodologías que apunten al logro de los objetivos, de manera adecuada y eficaz, para así dar cumplimiento a los plazos establecidos en el desarrollo del proyecto.\r\n❑\tInterpreta datos sobre un tema de ingeniería o de investigación, mediante un proceso de análisis que lleve a conclusiones.\r\n❑\tProduce un texto, con calidad técnica o científica, donde fundamenta las conclusiones de su trabajo de título, que evidencie un procesamiento y análisis de los resultados, considerando una estructura de introducción, revisión bibliográfica, metodologías, resultados, discusión y conclusiones.\r\n❑\tExpone en forma oral su propuesta de trabajo de título, demostrando en su presentación claridad, dominio del tema, capacidad de síntesis, precisión en el uso de los conceptos y manejo de un vocabulario propio de la disciplina.",
      "requirements": [
        "ME6908"
      ],
      "equivalences": [
        "ME69F"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6037",
      "weekly_modules": {
        "labs": 0,
        "lectures": 1,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "CI3201",
      "name": "Análisis de Estructuras Isostáticas",
      "department": {
        "name": "Departamento de Ingeniería Civil",
        "code": "DIC",
        "id": 6
      },
      "students_per_course": 57,
      "approval_rate": 0.86,
      "purpose": "Al término del curso el alumno demuestra que analiza estructuras isostáticas sometidas a cargas estáticas y que pueden modelarse por medio de barras.",
      "requirements": [
        "FI2001"
      ],
      "equivalences": [
        "CI32B",
        "ME3130"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3559",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "MA2002",
      "name": "Cálculo Avanzado y Aplicaciones",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 90,
      "approval_rate": 0.86,
      "purpose": "Al terminar este curso, el estudiante:\r\n Utiliza e interpreta las variaciones de una función vectorial de variable vectorial, y las aplica para modelar y resolver problemas físicos y geométricos en el sistema de referencia mas conveniente.\r\n Reconoce las ecuaciones en derivadas parciales clásicas y las relaciona con los modelos físicos que las motivan, para ello estará familiarizado con las técnicas clásicas que se utilizan para analizar y resolver esta clase de ecuaciones.",
      "requirements": [
        "MA2001",
        "MA2601"
      ],
      "equivalences": [
        "MA2A2",
        "MA26B",
        "MA221"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=13266",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "ME3401",
      "name": "Cinemática y Dinámica de Mecanismos",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 42,
      "approval_rate": 0.9,
      "purpose": null,
      "requirements": [
        "FI2001"
      ],
      "equivalences": [
        "ME36A",
        "ME3250"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3514",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "IN2201",
      "name": "Economía",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 85,
      "approval_rate": 0.91,
      "purpose": "El curso IN 2201, Economía, tiene como propósito que el o la estudiante determine, por una parte, el propósito del estudio de las ciencias económicas y, por otra, su importancia, campo y método de acción. En este contexto, el o la estudiante logre reconocer y reflexionar por qué es relevante para el desempeño futuro de un ingeniero saber de economía.\r\n\r\nEl curso busca que los y las estudiantes desarrolle una comprensión de la estructuras y organizaciones que se encuentran presentes en la discusión pública sobre temas económicos. Adicionalmente, deben aprender a distinguir aquellos eventos que son predecibles de acuerdo a su entendimiento del funcionamiento de la economía y la interacción de los mercados, de aquellos que son novedades o paradojas que están en proceso de ser explicados y siendo parte del debate científico o público contemporáneo.",
      "requirements": [
        "MA2001"
      ],
      "equivalences": [
        "IN2C1",
        "IN41A",
        "IN301"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3882",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "FI2002",
      "name": "Electromagnetismo",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 80,
      "approval_rate": 0.86,
      "purpose": "Este curso se ubica en el 4to semestre del ciclo de formación intermedia (Plan Común). El curso permite que el estudiante caracterice y describa los fenómenos electromagnéticos, abarcando desde la electrostática y magnetostática hasta la propagación de energía electromagnética. El estudiante tendrá así las herramientas fundamentales para valorar y argumentar las múltiples aplicaciones del electromagnetismo en diversas áreas de las ingenierías y ciencias. \r\n\r\nLa metodología que se utilizará en el curso es activo - participativa con el uso de diversas estrategias.",
      "requirements": [
        "MA2001",
        "MA2601",
        "FI2001"
      ],
      "equivalences": [
        "FI33A",
        "FI2A2",
        "FI302",
        "FI2002E"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3493",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "CM2004",
      "name": "Fisicoquímica",
      "department": {
        "name": "Departamento de Ciencia de los Materiales",
        "code": "CM",
        "id": 306
      },
      "students_per_course": 73,
      "approval_rate": 0.93,
      "purpose": "Al final del curso se espera que el estudiante maneje las herramientas físico-matemáticas, que le permitan, comprender y aplicar conceptos de química física para analizar y proponer soluciones en problemas de procesos que los requieran.",
      "requirements": [
        "CM1001",
        "MA2001",
        "FI2001S"
      ],
      "equivalences": [
        "CM2A4",
        "FI2004",
        "IQ2212"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3449",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "MA3403",
      "name": "Probabilidades y Estadística",
      "department": {
        "name": "Departamento de Ingeniería Matemática",
        "code": "DIM",
        "id": 21
      },
      "students_per_course": 80,
      "approval_rate": 0.84,
      "purpose": "El propósito de este curso es que el/la estudiante aplique los conceptos fundamentales de la\r\nteoría de probabilidades en la modelación y solución de problemas concretos que involucran\r\nfenómenos aleatorios. También que enuncie leyes clásicas de probabilidad discretas y continuas, que calcule con ellas y que las asocie a situaciones específicas de modelación. Además que aplique la Ley de Grandes Números y del Teorema Central del Límite.\r\nOtra parte del propósito de este curso es que el/la estudiante conozca los conceptos\r\nfundamentales de la Inferencia Estadística y de los modelos lineales, y los aplique junto a los\r\nconceptos de probabilidad. Junto a esto, que conozca lo que es un muestreo aleatorio y la\r\nimportancia de la distribución Normal y su rol en el Teorema Central del Límite, que estime\r\nparámetros de una distribución y reconozca sus propiedades, y que conozca el Lema de Neyman Pearson y su aplicación en la toma de decisiones con un test de hipótesis. Adicionalmente, que aplique un modelo de regresión lineal y evalúe sus resultados. Finalmente, que aplique la teoría de tests en casos clásicos como son: la comparación de dos poblaciones, la comprobación que un conjunto de valores muestrales siguen una determinada distribución, el test de independencia en una tabla de contingencia.",
      "requirements": [
        "MA2001"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3754",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "ME4707",
      "name": "Robótica",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 32,
      "approval_rate": 0.96,
      "purpose": null,
      "requirements": [
        "FI2003"
      ],
      "equivalences": [
        "ME5150"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6029",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "FI2004",
      "name": "Termodinámica",
      "department": {
        "name": "Departamento de Física",
        "code": "DFI",
        "id": 13
      },
      "students_per_course": 78,
      "approval_rate": 0.89,
      "purpose": "El curso de Termodinámica establece los conceptos fundamentales, a nivel macroscópico, de los fenómenos en que intervienen transferencias de energía. \r\nSe muestra que la termodinámica impone restricciones, lo que limita el rendimiento de máquinas y dispositivos, así como la factibilidad de que ocurran ciertos procesos. Se muestra que la solución de problemas de ingeniería y ciencias en el marco del desarrollo sostenible está limitada no solo por la finitud de recursos sino también por las leyes físicas.",
      "requirements": [
        "IQ2211",
        "CM1001",
        "MA2001",
        "FI2001"
      ],
      "equivalences": [
        "FI2A4",
        "FI22A",
        "FI212",
        "CM2004",
        "IQ2212"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3492",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "ME3201",
      "name": "Ciencias de los Materiales",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 47,
      "approval_rate": 0.93,
      "purpose": null,
      "requirements": [
        "CM2004",
        "FI2004",
        "CM1001",
        "FI2001"
      ],
      "equivalences": [
        "ME32A",
        "CM3201",
        "ME3110"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3511",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME4501",
      "name": "Control de Sistemas",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 36,
      "approval_rate": 0.87,
      "purpose": null,
      "requirements": [
        "ME3401"
      ],
      "equivalences": [
        "ME55A",
        "ME4150"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3515",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "IN3301",
      "name": "Evaluación de Proyectos",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 75,
      "approval_rate": 0.9,
      "purpose": "El curso se encuentra en el VI semestre de la carrera. Este curso de  tiene como propósito que los y las estudiantes puedan calcular el valor de un proyecto de inversión, a partir del análisis y uso de datos reales, de su estructuración en estados financieros contables (Balance, Estado de Resultados, Flujo de Caja), del diseño de estrategias financieras derivadas del diagnóstico y del uso de herramientas matemáticas financieras, desde una perspectiva tanto privada, de evaluación de negocios, como social en el caso de proyectos públicos de inversión. \r\n\r\nEl curso trabaja con una metodología activo - participativa, donde los y las estudiantes construyen su aprendizaje, en pro de desarrollar herramientas tanto de carácter económico- financiero como de trabajo en equipo. Lo anterior, incluye manejo de teoría, análisis de casos prácticos, con ejemplos de la vida cotidiana. El o la docente guía las discusiones, generando espacios de reflexión acerca del marco teórico y su aplicación, con una retroalimentación constante a los estudiantes.",
      "requirements": [
        "IN2201",
        "IN3141",
        "MA3403",
        "MA3401"
      ],
      "equivalences": [
        "IN4301"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3480",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "ME3301",
      "name": "Mecánica de Fluidos",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 19,
      "approval_rate": 0.89,
      "purpose": null,
      "requirements": [
        "FI2004",
        "CM2004"
      ],
      "equivalences": [
        "ME33A",
        "CI3101",
        "ME3140"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3513",
      "weekly_modules": {
        "labs": 1,
        "lectures": 3,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME3204",
      "name": "Mecánica de Sólidos",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 42,
      "approval_rate": 0.67,
      "purpose": null,
      "requirements": [
        "CI3201",
        "MA2002"
      ],
      "equivalences": [
        "ME3202",
        "ME3230"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6026",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME4704",
      "name": "Gestión de Operaciones",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 19,
      "approval_rate": 0.93,
      "purpose": "El propósito del curso es que el estudiante analice el funcionamiento de una empresa u organización pública o privada y elabore propuestas de mejora en su gestión de operaciones. Para ello, el estudiante analiza problemas operacionales utilizando herramientas cuantitativas y conceptuales que pueden ser utilizadas para proponer dichas propuestas de mejora. \r\nLas competencias del programa de Ingeniería Mecánica, a las que tributa el curso, tanto genéricas (CG) como específicas (CE) son:\r\nCE1: Concebir, formular y aplicar modelos físicos-matemáticos para la resolución de problemas relacionados con el diseño de componentes, equipos y sistemas mecánicos.\r\nCE3: Concebir y crear sistemas innovadores que den respuesta a nuevas necesidades tanto en el ámbito nacional como internacional.\r\nCE7: Gestionar procesos productivos, recursos, activos físicos y proyectos mecánicos.\r\nCG1: Comunicación profesional y académica: comunicar en español de forma estratégica, clara, eficaz, tanto en modalidad oral como escrita, puntos de vistas, propuestas de proyectos y resultados de investigación fundamentados, en situaciones de comunicación compleja, en ambientes sociales, académicos y profesionales.\r\nCG4: Trabajo en equipo: Trabajar en equipo, de forma estratégica y colaborativa, en diversas actividades formativas, a partir de la autogestión de sí mismo y de la relación con el otro, interactuando con los demás en diversos roles, de líder, colaborador u otros, según requerimientos u objetivos del trabajo, sin discriminar por género u otra razón.",
      "requirements": [
        "MA3403",
        "MA3701",
        "IN3171",
        "MA3711"
      ],
      "equivalences": [],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=48241",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "IN4703",
      "name": "Gestión de Operaciones I",
      "department": {
        "name": "Departamento de Ingeniería Industrial",
        "code": "DII",
        "id": 19
      },
      "students_per_course": 70,
      "approval_rate": 0.97,
      "purpose": null,
      "requirements": [
        "IN3701",
        "MA3701",
        "IQ3111",
        "MA3403",
        "MA3401",
        "MA3402"
      ],
      "equivalences": [
        "IN47A",
        "IN4273"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6137",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME3601",
      "name": "Ingeniería de Materiales I",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 27,
      "approval_rate": 0.91,
      "purpose": null,
      "requirements": [
        "ME3201",
        "ME3110"
      ],
      "equivalences": [
        "ME42A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3512",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME4301",
      "name": "Termotecnia",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 34,
      "approval_rate": 0.88,
      "purpose": null,
      "requirements": [
        "ME3301"
      ],
      "equivalences": [
        "ME43A",
        "IQ3201",
        "ME3240"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3517",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME4701",
      "name": "Vibraciones Mecánicas",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 34,
      "approval_rate": 0.94,
      "purpose": null,
      "requirements": [
        "ME3401",
        "ME3204",
        "MA3403"
      ],
      "equivalences": [
        "ME4130"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6043",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME5500",
      "name": "Elementos de Máquinas",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 37,
      "approval_rate": 0.9,
      "purpose": null,
      "requirements": [
        "ME3204",
        "ME3601",
        "ME3202",
        "ME3203",
        "ME4602"
      ],
      "equivalences": [
        "ME5600",
        "ME4230"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=5996",
      "weekly_modules": {
        "labs": 1,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME5702",
      "name": "Gestión de Activos Físicos",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 30,
      "approval_rate": 0.94,
      "purpose": null,
      "requirements": [
        "ME4701",
        "IN4703"
      ],
      "equivalences": [
        "ME4160"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6049",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME4601",
      "name": "Ingeniería de Materiales II",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 32,
      "approval_rate": 0.95,
      "purpose": null,
      "requirements": [
        "ME3601"
      ],
      "equivalences": [
        "ME42B",
        "ME3210"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3516",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 3,
      "code": "ME4603",
      "name": "Taller Mecánico",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 9,
      "approval_rate": 0.98,
      "purpose": null,
      "requirements": [
        "ME3601",
        "ME3203"
      ],
      "equivalences": [
        "ME3220"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6042",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "ME4302",
      "name": "Transferencia de Calor",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 34,
      "approval_rate": 0.91,
      "purpose": null,
      "requirements": [
        "ME4301",
        "ME3301",
        "ME3140"
      ],
      "equivalences": [
        "ME43B",
        "ME4140"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6040",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME5601",
      "name": "Diseño de Sistemas Mecánicos",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 29,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [
        "ME5600",
        "ME5500",
        "ME4701"
      ],
      "equivalences": [
        "ME5120"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6047",
      "weekly_modules": {
        "labs": 2,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME5300",
      "name": "Máquinas",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 39,
      "approval_rate": 0.77,
      "purpose": null,
      "requirements": [
        "ME4302"
      ],
      "equivalences": [
        "ME53A",
        "ME4240"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6045",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 1
      }
    },
    {
      "credits": 7,
      "code": "ME4901",
      "name": "Práctica Profesional I",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 29,
      "approval_rate": 0.99,
      "purpose": "En el contexto del rediseño curricular de la formación en Ingeniería y Ciencias, las\r\nprácticas profesionales han sido definidas como hitos evaluativos del Perfil de egreso\r\nde la carrera de la FCFM, pues ellas corresponden a actividades curriculares que\r\npermiten evidenciar y monitorear el logro de una serie de competencias relevantes\r\ncomprometidas en dicho perfil. Además, permite darle la posibilidad a los/las\r\nestudiantes de demostrar de manera auténtica los logros desarrollados en su\r\nformación hasta el momento en donde se ubica la práctica según plan de estudio.\r\nPor tanto, en cada práctica profesional el/la estudiante cumple un rol central y\r\nprotagónico, pues tendrá la oportunidad para demostrar desempeños tanto de las\r\ncompetencias específicas de su formación como de las competencias genéricas tales\r\ncomo trabajo en equipo, comunicación académica y profesional, compromiso ético e\r\ninnovación.\r\nPor otra parte, las prácticas profesionales constituyen una valiosa oportunidad para\r\nvincular la universidad con la empresa a través de los/as estudiantes.",
      "requirements": [
        "ME4110",
        "ME4130",
        "ME4140",
        "ME4150",
        "ME4160"
      ],
      "equivalences": [
        "ME49A",
        "ME5901"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6044",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "ME5700",
      "name": "Procesos de Manufactura",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 29,
      "approval_rate": 0.96,
      "purpose": null,
      "requirements": [
        "ME4601",
        "ME4707",
        "ME4603",
        "ME4602"
      ],
      "equivalences": [
        "ME58A",
        "ME4110"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6048",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 3,
      "code": "ME5301",
      "name": "Laboratorio de Máquinas",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 7,
      "approval_rate": 0.98,
      "purpose": null,
      "requirements": [
        "ME5300"
      ],
      "equivalences": [
        "ME53B",
        "ME5240"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3737",
      "weekly_modules": {
        "labs": 2,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 7,
      "code": "ME5901",
      "name": "Práctica Profesional II",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 27,
      "approval_rate": 0.99,
      "purpose": null,
      "requirements": [
        "ME4901"
      ],
      "equivalences": [
        "ME59A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3790",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "ME6600",
      "name": "Proyecto en Ingeniería Mecánica",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 33,
      "approval_rate": 0.98,
      "purpose": null,
      "requirements": [
        "ME5601",
        "IN3301"
      ],
      "equivalences": [
        "ME66A",
        "ME5220"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6050",
      "weekly_modules": {
        "labs": 0,
        "lectures": 3,
        "auxs": 2
      }
    },
    {
      "credits": 6,
      "code": "ME5701",
      "name": "Proyectos en Materiales y Manufactura",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 27,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [
        "ME5700"
      ],
      "equivalences": [
        "ME5110"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3869",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 1
      }
    },
    {
      "credits": 6,
      "code": "ME5400",
      "name": "Ingeniería en Termofluidos",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 13,
      "approval_rate": 1.0,
      "purpose": null,
      "requirements": [
        "ME5300",
        "ME5301"
      ],
      "equivalences": [
        "ME5140"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=6046",
      "weekly_modules": {
        "labs": 0,
        "lectures": 2,
        "auxs": 0
      }
    },
    {
      "credits": 7,
      "code": "ME6901",
      "name": "Práctica Profesional III",
      "department": {
        "name": "Departamento de Ingeniería Mecánica",
        "code": "DIMEC",
        "id": 22
      },
      "students_per_course": 23,
      "approval_rate": 0.98,
      "purpose": null,
      "requirements": [
        "ME5901"
      ],
      "equivalences": [
        "ME69A"
      ],
      "program_url": "https://ucampus.uchile.cl/m/fcfm_catalogo/programa?bajar=1&id=3848",
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 18,
      "code": "plan75d73a7e7522366f52f228db237e8f97",
      "name": "Ingeniería Electivos Mecanica v4",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 18 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "plan3135bf2e05a278fabd04dccceb43a4f2",
      "name": "Ingenieria Integral Mecanica",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 30,
      "code": "planb044c82a15e1efad399c8ec2cfcd9d62",
      "name": "Licenciatura Electivos Mecanica",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 30 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 6,
      "code": "plan049c417ab9c446dd308108f7210c783f",
      "name": "Formación Integral Licenciatura",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 6 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    },
    {
      "credits": 9,
      "code": "plan2c9b32e0c0707f6b10993b1254aa3a93",
      "name": "Formación Integral FG/EH",
      "department": null,
      "students_per_course": 0,
      "approval_rate": 0.0,
      "purpose": "Es necesario aprobar 9 créditos de una lista definida por la institución.",
      "requirements": [],
      "equivalences": [],
      "program_url": null,
      "weekly_modules": {
        "labs": 0,
        "lectures": 0,
        "auxs": 0
      }
    }
  ]
}